brodricyoung/mini-crane-project/stm32/mini_crane_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define RotaryEncoder_CLK_Pin GPIO_PIN_0
#define RotaryEncoder_CLK_GPIO_Port GPIOA
#define RotaryEncoder_DT_Pin GPIO_PIN_1
#define RotaryEncoder_DT_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define Winch_IN1_Pin GPIO_PIN_6
#define Winch_IN1_GPIO_Port GPIOA
#define Winch_IN2_Pin GPIO_PIN_7
#define Winch_IN2_GPIO_Port GPIOA
#define RotaryEncoder_SW_Pin GPIO_PIN_0
#define RotaryEncoder_SW_GPIO_Port GPIOB
#define RotaryEncoder_SW_EXTI_IRQn EXTI0_IRQn
#define Slew_IN1_Pin GPIO_PIN_1
#define Slew_IN1_GPIO_Port GPIOB
#define Slew_IN2_Pin GPIO_PIN_2
#define Slew_IN2_GPIO_Port GPIOB
#define Trolley_IN3_Pin GPIO_PIN_8
#define Trolley_IN3_GPIO_Port GPIOA
#define Trolley_IN4_Pin GPIO_PIN_9
#define Trolley_IN4_GPIO_Port GPIOA
#define Slew_IN3_Pin GPIO_PIN_11
#define Slew_IN3_GPIO_Port GPIOA
#define Slew_IN4_Pin GPIO_PIN_12
#define Slew_IN4_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
